//          УМОВНІ РОЗГАЛУДЖЕННЯ: if- else
// Інструкція if(...) обчислює умову в дужках і, якщо результат умови true, виконує блок коду.
if (5 * 5 === 25) {
  console.log("Виведе в консоль цей рядок");
}
// Блок “else”
//Вираз if може містити необов’язковий блок “else” (“інакше”). Він виконується, коли
//умова є хибною.
if (5 * 5 === 24) {
  console.log("true");
} else {
  console.log("false");
}

//Декілька умов: “else if”
//Іноді ми хотіли б перевірити кілька варіантів умови. Блок else if дозволяє нам це зробити.
if (5 + 5 === 11) {
  console.log("5+5 === 10");
} else if (2 + 2 === 5) {
  console.log("2+2 === 4");
} else {
  console.log("no");
}
// Умовний оператор ‘?’
// Так званий “умовний” оператор або оператор “знак питання” дає нам зробити
// це в більш короткій і простій формі.
//Оператор представлений знаком питання ?. Іноді його називають “тернарним”,
//оскільки оператор має три операнди.
//let result = умова ? значення1 : значення2;
2 + 2 === 4 ? console.log("1") : console.log("2");
5 * 5 === 24 ? console.log(true) : console.log(false);

//                  КОНСТРУКЦІЯ switch
// Конструкція switch може замінити кілька if.
// Вона дає можливість більш наочного способу порівняння значення відразу з кількома варіантами.
// Конструкція switch має один або більше case блоків та необов’язковий блок default.
let number = 3;
switch (number) {
  case 0:
    console.log("number = 0");
    break;
  case 1:
    console.log("number = 1");
    break;
  case 5:
    console.log("number = 2");
    break;
  case 3:
    console.log("number = 3");
    break;
  case 4:
    console.log("number = 4");
    break;
  default:
    console.log("number - від'єине число, або х більше 4");
    break;
}

// Значення змінної number перевіряється на строгу рівність (===) значенню із першого
// блоку case (0), потім значенню із другого блоку (1) і так далі.
// Якщо строго рівне значення знайдено, то switch починає виконання коду із
// відповідного case до найближчого break або до кінця всієї конструкції switch.
// Якщо жодне case-значення не збігається – виконується код із блоку default (якщо він присутній).
// Якщо break відсутній, то буде продовжено виконання коду по наступним блокам case без перевірок.
